public enum TypeBuildings //магазины, заводы, шахты, пол€ и т.д.
{
    cafe, //все красные карты

    field, //пшеничное поле, кукурузное поле, цветник, виноградник, €блоневый сад
    farm, //ферма
    mine, //лес, шахта
    aquatic, //рыбацкий баркас, траулер

    shop, //пекарн€, универмаг, супермаркет, цветочный магазин
    company, //компании по сносу зданий, кредитное бюро, транспортна€ компани€
    plant, //сыроварн€, мебельна€ фабрика, винный завод, фабрика напитков, продуктовый склад
    market, //овощной рынок

    attraction, //все достопримечательности (+все фиолетовые карты)
}